33/feature.SOAP_POST.karate-json.txt

{"failedCount":0,"prefixedPath":"classpath:feature\/SOAP_POST.feature","packageQualifiedName":"feature.SOAP_POST","loopIndex":-1,"relativePath":"feature\/SOAP_POST.feature","scenarioResults":[{"sectionIndex":0,"stepResults":[{"result":{"nanos":625644,"millis":0.625644,"status":"passed"},"step":{"background":true,"line":4,"prefix":"*","index":0,"text":"url 'https:\/\/www.dataaccess.com\/webservicesserver\/NumberConversion.wso'"}},{"result":{"nanos":1630815,"millis":1.630815,"status":"passed"},"step":{"background":true,"line":5,"prefix":"*","index":1,"text":"header Content-Type = 'text\/xml; charset=utf-8'"}},{"result":{"nanos":1218786,"millis":1.218786,"status":"passed"},"step":{"background":true,"line":6,"prefix":"*","index":2,"text":"def path = karate.properties['user.dir']"}},{"result":{"nanos":700050,"millis":0.70005,"status":"passed"},"step":{"background":true,"line":7,"prefix":"*","index":3,"text":"def file = path + '\/src\/test\/resources\/payload\/post.xml'"}},{"result":{"nanos":128754686,"millis":128.754686,"status":"passed"},"step":{"background":true,"line":8,"prefix":"*","index":4,"text":"def body = read('file:' + file)"}},{"result":{"nanos":346024,"millis":0.346024,"status":"passed"},"step":{"line":11,"prefix":"Given","index":0,"text":"request body"}},{"result":{"nanos":1057453677,"millis":1057.453677,"status":"passed"},"step":{"line":12,"prefix":"When","index":1,"text":"soap action 'NumberToWords'"},"stepLog":"23:55:09.335 request:\n1 > POST https:\/\/www.dataaccess.com\/webservicesserver\/NumberConversion.wso\n1 > Content-Type: text\/xml; charset=UTF-8\n1 > SOAPAction: NumberToWords\n1 > Content-Length: 237\n1 > Host: www.dataaccess.com\n1 > Connection: Keep-Alive\n1 > User-Agent: Apache-HttpClient\/4.5.13 (Java\/1.8.0_382)\n1 > Accept-Encoding: gzip,deflate\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\n  <soap:Body>\n    <NumberToWords xmlns=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\n      <ubiNum>500<\/ubiNum>\n    <\/NumberToWords>\n  <\/soap:Body>\n<\/soap:Envelope>\n\n23:55:09.657 response time in milliseconds: 322\n1 < 200\n1 < Cache-Control: private, max-age=0\n1 < Content-Type: text\/xml; charset=utf-8\n1 < Vary: Accept-Encoding\n1 < Server: Server\n1 < Web-Service: DataFlex 19.1\n1 < X-Powered-By: ASP.NET\n1 < Date: Fri, 11 Aug 2023 23:55:09 GMT\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\r\n  <soap:Body>\r\n    <m:NumberToWordsResponse xmlns:m=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\r\n      <m:NumberToWordsResult>five hundred <\/m:NumberToWordsResult>\r\n    <\/m:NumberToWordsResponse>\r\n  <\/soap:Body>\r\n<\/soap:Envelope>\n\n"},{"result":{"nanos":8901,"millis":0.008901,"status":"passed"},"step":{"line":13,"prefix":"Then","index":2,"text":"status 200"}},{"result":{"nanos":5770902,"millis":5.770902,"status":"passed"},"step":{"line":14,"prefix":"And","index":3,"text":"print response"},"stepLog":"23:55:09.669 [print] <soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\n  <soap:Body>\n    <m:NumberToWordsResponse xmlns:m=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\n      <m:NumberToWordsResult>five hundred<\/m:NumberToWordsResult>\n    <\/m:NumberToWordsResponse>\n  <\/soap:Body>\n<\/soap:Envelope>\n \n"},{"result":{"nanos":7451020,"millis":7.45102,"status":"passed"},"step":{"line":15,"prefix":"And","index":4,"text":"match response \/Envelope\/Body\/NumberToWordsResponse\/NumberToWordsResult == 'five hundred'"}}],"executorName":"pool-1-thread-5","line":10,"name":"Sample POST","description":"","durationMillis":1203.960505,"startTime":1691798108461,"failed":false,"refId":"[1:10]","endTime":1691798109677,"exampleIndex":-1},{"sectionIndex":1,"stepResults":[{"result":{"nanos":20638956,"millis":20.638956,"status":"passed"},"step":{"background":true,"line":4,"prefix":"*","index":0,"text":"url 'https:\/\/www.dataaccess.com\/webservicesserver\/NumberConversion.wso'"}},{"result":{"nanos":425230,"millis":0.42523,"status":"passed"},"step":{"background":true,"line":5,"prefix":"*","index":1,"text":"header Content-Type = 'text\/xml; charset=utf-8'"}},{"result":{"nanos":848160,"millis":0.84816,"status":"passed"},"step":{"background":true,"line":6,"prefix":"*","index":2,"text":"def path = karate.properties['user.dir']"}},{"result":{"nanos":614243,"millis":0.614243,"status":"passed"},"step":{"background":true,"line":7,"prefix":"*","index":3,"text":"def file = path + '\/src\/test\/resources\/payload\/post.xml'"}},{"result":{"nanos":108086028,"millis":108.086028,"status":"passed"},"step":{"background":true,"line":8,"prefix":"*","index":4,"text":"def body = read('file:' + file)"}},{"result":{"nanos":491501159,"millis":491.501159,"status":"passed"},"step":{"line":18,"prefix":"*","index":0,"text":"set body\/Envelope\/Body\/NumberToWords\/ubiNum = 300"}},{"result":{"nanos":2208354,"millis":2.208354,"status":"passed"},"step":{"line":19,"prefix":"Given","index":1,"text":"request body"}},{"result":{"nanos":568148771,"millis":568.148771,"status":"passed"},"step":{"line":20,"prefix":"When","index":2,"text":"soap action 'NumberToWords'"},"stepLog":"23:55:09.333 request:\n1 > POST https:\/\/www.dataaccess.com\/webservicesserver\/NumberConversion.wso\n1 > Content-Type: text\/xml; charset=UTF-8\n1 > SOAPAction: NumberToWords\n1 > Content-Length: 237\n1 > Host: www.dataaccess.com\n1 > Connection: Keep-Alive\n1 > User-Agent: Apache-HttpClient\/4.5.13 (Java\/1.8.0_382)\n1 > Accept-Encoding: gzip,deflate\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\n  <soap:Body>\n    <NumberToWords xmlns=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\n      <ubiNum>300<\/ubiNum>\n    <\/NumberToWords>\n  <\/soap:Body>\n<\/soap:Envelope>\n\n23:55:09.666 response time in milliseconds: 333\n1 < 200\n1 < Cache-Control: private, max-age=0\n1 < Content-Type: text\/xml; charset=utf-8\n1 < Vary: Accept-Encoding\n1 < Server: Server\n1 < Web-Service: DataFlex 19.1\n1 < X-Powered-By: ASP.NET\n1 < Date: Fri, 11 Aug 2023 23:55:09 GMT\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\r\n  <soap:Body>\r\n    <m:NumberToWordsResponse xmlns:m=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\r\n      <m:NumberToWordsResult>three hundred <\/m:NumberToWordsResult>\r\n    <\/m:NumberToWordsResponse>\r\n  <\/soap:Body>\r\n<\/soap:Envelope>\n\n"},{"result":{"nanos":7001,"millis":0.007001,"status":"passed"},"step":{"line":21,"prefix":"Then","index":3,"text":"status 200"}},{"result":{"nanos":4758232,"millis":4.758232,"status":"passed"},"step":{"line":22,"prefix":"And","index":4,"text":"print response"},"stepLog":"23:55:09.672 [print] <soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\n  <soap:Body>\n    <m:NumberToWordsResponse xmlns:m=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\n      <m:NumberToWordsResult>three hundred<\/m:NumberToWordsResult>\n    <\/m:NumberToWordsResponse>\n  <\/soap:Body>\n<\/soap:Envelope>\n \n"},{"result":{"nanos":1691918,"millis":1.691918,"status":"passed"},"step":{"line":23,"prefix":"And","index":5,"text":"match response \/Envelope\/Body\/NumberToWordsResponse\/NumberToWordsResult == 'three hundred'"}}],"executorName":"pool-1-thread-1","line":17,"name":"Sample POST after updating xml file content","description":"","durationMillis":1198.928052,"startTime":1691798108475,"failed":false,"refId":"[2:17]","endTime":1691798109674,"exampleIndex":-1}],"callDepth":0,"name":"SOAP Sample POST","description":"","resultDate":"2023-08-11 11:55:10 PM","durationMillis":2402.888557,"passedCount":2}